; domain
(define (domain library-domain)

    (:requirements :strips)

    (:predicates (loc ?x) (workbench ?x) (at ?x ?y)
                (book ?x) (standard-book ?x) (rare-book ?x)
                (tool ?x) (kit ?x) (jacket ?x)
                (free-hand-book) (holding-book ?x)
                (free-hand-tool) (holding-tool ?x)
                (restored ?x)
    )

    ;; Action to pick up a Standard Book
    ;; Same logic as 'pick-dog': no extra tools required.
    (:action pick-standard-book
        :parameters (?b ?l)
        :precondition (and
            (standard-book ?b)
            (book ?b)
            (loc ?l)
            (at ?b ?l)
            (free-hand-book)
        )
        :effect (and
            (holding-book ?b)
            (not (at ?b ?l))
            (not (free-hand-book))
        )
    )

    ;; Action to pick up a Rare Book
    ;; LOGIC ADDED: Requires holding a jacket. The jacket is consumed (removed from hand).
    ;; Corresponds to 'pick-cat' in the Vet domain.
    (:action pick-rare-book
       :parameters (?b ?l ?j)
       :precondition (and
            (rare-book ?b)
            (book ?b)
            (loc ?l)
            (at ?b ?l)
            (free-hand-book)
            (holding-tool ?j)
            (jacket ?j)
       )
       :effect (and
            (holding-book ?b)
            (not (at ?b ?l))
            (not (free-hand-book))

            ;; Jacket is used to wrap the book and is removed from hand
            (free-hand-tool)
            (not (holding-tool ?j))
       )
    )

    ;; Action to drop a book
    (:action drop-book
        :parameters (?b ?l)
        :precondition (and
            (holding-book ?b)
            (book ?b)
            (loc ?l)
        )
        :effect (and
            (at ?b ?l)
            (free-hand-book)
            (not (holding-book ?b))
        )
    )

    ;; Action to pick up a tool (Jacket or Kit)
    (:action pick-tool
        :parameters (?t ?l)
        :precondition (and
            (tool ?t)
            (loc ?l)
            (at ?t ?l)
            (free-hand-tool)
        )
        :effect (and
            (holding-tool ?t)
            (not (at ?t ?l))
            (not (free-hand-tool))
        )
    )

    ;; Action to drop a tool
    (:action drop-tool
        :parameters (?t ?l)
        :precondition (and
            (holding-tool ?t)
            (tool ?t)
            (loc ?l)
        )
        :effect (and
            (at ?t ?l)
            (free-hand-tool)
            (not (holding-tool ?t))
        )
    )

    ;; Action to restore a book
    ;; LOGIC ADDED: Sets the book to 'restored'.
    ;; Corresponds to 'use-syringe' in the Vet domain.
    (:action restore-book
        :parameters (?b ?w ?k)
        :precondition (and
            (book ?b)
            (loc ?w)
            (workbench ?w)
            (at ?b ?w)
            (holding-tool ?k)
            (kit ?k)
        )
        :effect (and
            (restored ?b)
        )
    )
)

; problem
(define (problem library-problem-2)

    (:domain library-domain)
    (:objects 
        std1 rare1 rare2         ;; The Books
        shelf workbench archive  ;; The Locations
        kit1                     ;; The Repair Kit
        j1 j2 j3 j4              ;; The Dust Jackets
    )

    (:init 
        ;; Types
        (standard-book std1) (rare-book rare1) (rare-book rare2)
        (book std1) (book rare1) (book rare2)

        (tool kit1) (kit kit1)
        (tool j1) (tool j2) (tool j3) (tool j4)
        (jacket j1) (jacket j2) (jacket j3) (jacket j4)

        (loc shelf) (loc workbench) (loc archive) (workbench workbench)
        
        ;; Initial State
        (free-hand-book) (free-hand-tool)

        (at kit1 workbench)
        (at j1 archive) (at j2 archive) (at j3 archive) (at j4 archive)
        (at std1 shelf) (at rare1 shelf) (at rare2 shelf)
    )
  
    (:goal (and
        (restored std1) (restored rare1) (restored rare2)
        (at std1 archive)
        (at rare1 shelf) (at rare2 shelf)
    ))
)

; plan
1. (pick-standard-book std1 shelf)
   deleted: (at std1 shelf) (free-hand-book)
   added: (holding-book std1)
   goals met: 2 of 6
2. (drop-book std1 workbench)
   deleted: (holding-book std1)
   added: (at std1 workbench) (free-hand-book)
   goals met: 2 of 6
3. (pick-tool j4 archive)
   deleted: (at j4 archive) (free-hand-tool)
   added: (holding-tool j4)
   goals met: 2 of 6
4. (pick-rare-book rare1 shelf j4)
   deleted: (at rare1 shelf) (free-hand-book) (holding-tool j4)
   added: (holding-book rare1) (free-hand-tool)
   goals met: 1 of 6
5. (drop-book rare1 workbench)
   deleted: (holding-book rare1)
   added: (at rare1 workbench) (free-hand-book)
   goals met: 1 of 6
6. (pick-tool j2 archive)
   deleted: (at j2 archive) (free-hand-tool)
   added: (holding-tool j2)
   goals met: 1 of 6
7. (pick-rare-book rare2 shelf j2)
   deleted: (at rare2 shelf) (free-hand-book) (holding-tool j2)
   added: (holding-book rare2) (free-hand-tool)
   goals met: 0 of 6
8. (drop-book rare2 workbench)
   deleted: (holding-book rare2)
   added: (at rare2 workbench) (free-hand-book)
   goals met: 0 of 6
9. (pick-tool kit1 workbench)
   deleted: (at kit1 workbench) (free-hand-tool)
   added: (holding-tool kit1)
   goals met: 0 of 6
10. (restore-book std1 workbench kit1)
   added: (restored std1)
   goals met: 1 of 6
11. (pick-standard-book std1 workbench)
   deleted: (at std1 workbench) (free-hand-book)
   added: (holding-book std1)
   goals met: 1 of 6
12. (drop-book std1 archive)
   deleted: (holding-book std1)
   added: (at std1 archive) (free-hand-book)
   goals met: 2 of 6
13. (restore-book rare1 workbench kit1)
   added: (restored rare1)
   goals met: 3 of 6
14. (restore-book rare2 workbench kit1)
   added: (restored rare2)
   goals met: 4 of 6
15. (drop-tool kit1 workbench)
   deleted: (holding-tool kit1)
   added: (at kit1 workbench) (free-hand-tool)
   goals met: 4 of 6
16. (pick-tool j1 archive)
   deleted: (at j1 archive) (free-hand-tool)
   added: (holding-tool j1)
   goals met: 4 of 6
17. (pick-rare-book rare1 workbench j1)
   deleted: (at rare1 workbench) (free-hand-book) (holding-tool j1)
   added: (holding-book rare1) (free-hand-tool)
   goals met: 4 of 6
18. (drop-book rare1 shelf)
   deleted: (holding-book rare1)
   added: (at rare1 shelf) (free-hand-book)
   goals met: 5 of 6
19. (pick-tool j3 archive)
   deleted: (at j3 archive) (free-hand-tool)
   added: (holding-tool j3)
   goals met: 5 of 6
20. (pick-rare-book rare2 workbench j3)
   deleted: (at rare2 workbench) (free-hand-book) (holding-tool j3)
   added: (holding-book rare2) (free-hand-tool)
   goals met: 5 of 6
21. (drop-book rare2 shelf)
   deleted: (holding-book rare2)
   added: (at rare2 shelf) (free-hand-book)
   goals met: 6 of 6
